# CannotDivideCurtainGrid Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..CannotDivideCurtainGrid Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
Can't divide Curtain Grid by Grid Line.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotDivideCurtainGrid { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotDivideCurtainGrid As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotDivideCurtainGrid {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace